Tekla.Structures.ModelInternal.DelegateProxy
CDelegate remote class proxy.

Tekla.Structures.ModelInternal.DelegateProxy.#cctor
Initializes static instance variable.

Tekla.Structures.ModelInternal.DelegateProxy.Initialize
Initializes the delegate proxy,

Tekla.Structures.ModelInternal.DelegateProxy.Delegate
Gets the singleton CDelegate instance that includes model API methods.

Tekla.Structures.ModelInternal.DelegateProxy.DeactivateInterface(System.String)
Deactivate Tekla.Structures.Model interface
Param:
Returns: